from enum import Enum


class BotCommand(Enum):
    """Перечисление команд, поддерживаемых Telegram-ботом.

    Содержит список фиксированных команд, которые бот распознаёт и обрабатывает.
    Каждая команда представлена строковым значением, начинающимся c символа '/'.

    :ivar START: Команда для регистрации пользователя.
    :ivar HELP: Команда для отображения справки.
    :ivar TRACK: Команда для начала отслеживания ссылки.
    :ivar UNTRACK: Команда для прекращения отслеживания ссылки.
    :ivar LIST: Команда для вывода списка отслеживаемых ссылок.
    :ivar CHAT_ID: Команда для получения ID чата.
    """

    START = "/start"
    HELP = "/help"
    TRACK = "/track"
    UNTRACK = "/untrack"
    LIST = "/list"
    CHAT_ID = "/chat_id"
